
'''
date: 20180108  20:52  周一

topic：学习参数列表中*和**的使用方式

   *: 表示元组，收集其余位置的参数
   **: 代表字典，字典处理剩余的键值对

用途：*,**的变量可以用来给一个函数预设一个变量空间，
      当我们暂时不知道函数变量会是什么样的时候，
      可以使用*,**
'''


def print_params(x,y,z=3,*pospar,**keypar):
  print (x,y,z)
  print(pospar)
  print(keypar)
  print ("#"*20)


print_params(1,2,3,4,5)

print_params(1,2,3,a=1,b=2)

print_params(1,2,3,a=1,b=2,c=3)

print_params(1,2,3,4,5,a=1,b=2,c=3)

'''
(1, 2, 3)
(4, 5)
{}
####################
(1, 2, 3)
()
{'a': 1, 'b': 2}
####################
(1, 2, 3)
()
{'a': 1, 'c': 3, 'b': 2}
####################
(1, 2, 3)
(4, 5)
{'a': 1, 'c': 3, 'b': 2}
####################
'''
